<?php

// 定義:公元年份非4的倍數，為365天平年。
// 公元年份為4的倍數但非100的倍數，為366天閏年。
// 公元年份為100的倍數但非400的倍數（1700年、1800年及1900年）為平年。
// 公元年份為400的倍數（1600年及2000年）為閏年。

// $year=2024;
// if ($year%4!=0){
//     echo "平年";
// }else{
//     if ($year%100==0){
//         echo "平年";
//     }
//     else{
//         if ($year%400==0){
//             echo "閏年";
//             }
//             else{
//                 echo "平年";
//             }
//        }     
// }


$year = 2025; // 定義年份
if ($year % 4 != 0) {
    echo "平年";
} else {
    if ($year % 100 == 0 && $year % 400 != 0) {
        echo "平年";
    } else {
        echo "閏年";
    }
}
?>